Applying **stage**:
```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/unite-compress-stage/runs/run-nRYSpmbKdhMFXBkR

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.base: Reading...
data.terraform_remote_state.base: Read complete after 0s
module.app.github_repository_environment.env: Refreshing state... [id=unite-compress:stage]
module.app.data.digitalocean_domain.domain: Reading...
module.app.digitalocean_spaces_bucket.bucket: Refreshing state... [id=unite-compress-stage]
module.app.digitalocean_droplet.droplet: Refreshing state... [id=338222064]
module.app.github_actions_environment_secret.tfvars["stage_django"]: Refreshing state... [id=unite-compress:stage:stage_django]
module.app.github_actions_environment_secret.tfvars["stage_traefik"]: Refreshing state... [id=unite-compress:stage:stage_traefik]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Refreshing state... [id=unite-compress:stage:prod_traefik]
module.app.github_actions_environment_secret.tfvars["prod_postgres"]: Refreshing state... [id=unite-compress:stage:prod_postgres]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Refreshing state... [id=unite-compress:stage:prod_django]
module.app.data.digitalocean_domain.domain: Read complete after 1s [id=e-learning4all.app]
module.app.github_actions_environment_secret.droplet_host: Refreshing state... [id=unite-compress:stage:droplet_host]
module.app.digitalocean_record.a: Refreshing state... [id=360843313]
module.app.digitalocean_project_resources.resources: Refreshing state... [id=1c2195fe-8f92-41f4-9403-684b2b58cd6f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.app.digitalocean_record.a will be created
  + resource "digitalocean_record" "a" {
      + domain = "e-learning4all.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "staging"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "207.154.218.142"
    }

  # module.app.digitalocean_spaces_bucket.bucket will be updated in-place
  ~ resource "digitalocean_spaces_bucket" "bucket" {
        id                 = "unite-compress-stage"
        name               = "unite-compress-stage"
        # (6 unchanged attributes hidden)

      ~ cors_rule {
          ~ allowed_origins = [
              - "*.unite.academy",
              + "*.e-learning4all.app",
            ]
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```
```
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/unite-compress-stage/runs/run-nJQM5hP8zTj5kXXj

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.base: Reading...
data.terraform_remote_state.base: Read complete after 0s
module.app.github_repository_environment.env: Refreshing state... [id=unite-compress:stage]
module.app.data.digitalocean_domain.domain: Reading...
module.app.digitalocean_spaces_bucket.bucket: Refreshing state... [id=unite-compress-stage]
module.app.digitalocean_droplet.droplet: Refreshing state... [id=338222064]
module.app.github_actions_environment_secret.tfvars["stage_django"]: Refreshing state... [id=unite-compress:stage:stage_django]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Refreshing state... [id=unite-compress:stage:prod_django]
module.app.github_actions_environment_secret.tfvars["prod_postgres"]: Refreshing state... [id=unite-compress:stage:prod_postgres]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Refreshing state... [id=unite-compress:stage:prod_traefik]
module.app.github_actions_environment_secret.tfvars["stage_traefik"]: Refreshing state... [id=unite-compress:stage:stage_traefik]
module.app.data.digitalocean_domain.domain: Read complete after 0s [id=e-learning4all.app]
module.app.github_actions_environment_secret.droplet_host: Refreshing state... [id=unite-compress:stage:droplet_host]
module.app.digitalocean_record.a: Refreshing state... [id=360843313]
module.app.digitalocean_project_resources.resources: Refreshing state... [id=1c2195fe-8f92-41f4-9403-684b2b58cd6f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.app.digitalocean_record.a will be created
  + resource "digitalocean_record" "a" {
      + domain = "e-learning4all.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "staging"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "207.154.218.142"
    }

  # module.app.digitalocean_spaces_bucket.bucket will be updated in-place
  ~ resource "digitalocean_spaces_bucket" "bucket" {
        id                 = "unite-compress-stage"
        name               = "unite-compress-stage"
        # (6 unchanged attributes hidden)

      ~ cors_rule {
          ~ allowed_origins = [
              - "*.unite.academy",
              + "*.e-learning4all.app",
            ]
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


module.app.digitalocean_spaces_bucket.bucket: Modifying... [id=unite-compress-stage]
module.app.digitalocean_record.a: Creation complete after 1s [id=367984425]
module.app.digitalocean_spaces_bucket.bucket: Modifications complete after 1s [id=unite-compress-stage]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.

Outputs:

droplet_host = "207.154.218.142"

```